[
    {
        "id": "1",
        "title": "Projet Booki",
        "src": "/src/assets/photos/booki.webp",
        "alt": "image du projet Booki",
        "description": "Intégration de la maquette de la page d'accueil d'un site permettant aux usagers de trouver des hébergements et des activités dans la ville de leur choix. Implémenter une interface responsive." ,
        "github": "https://github.com/VivianeCG/P2_Booki.git"
    },
    {
        "id": "2",
        "title": "Projet Sophie Bluel",
        "src": "src/assets/photos/bluel.webp",
        "alt": "image du projet Sophie Bluel",
        "description": "Conception du portfolio d'une architecte d'intérieur avec page de présentation des travaux, de connexion de l'administrateur et modale pour uploader les nouveaux médias. Utilisation de JavaScript pour récupérer des données dans un formulaire, gérer des événements utlisateur et manipuler le DOM.",
        "github": "https://github.com/VivianeCG/P3_Bluel.git"
    },
    {
        "id": "3",
        "title": "Projet Nica Carducci",
        "src": "src/assets/photos/carducci.webp",
        "alt": "image du projet Nina Carducci",
        "description": "Optimisation des performances et débuggage du site, rédaction d'un cahier de recette pour tester le site. Optimisation du référencement (SEO) et amélioration de l'accessibilité du site." ,
        "github": "https://github.com/VivianeCG/P5_Carducci.git"
    },
    {
        "id": "4",
        "title": "Projet Kasa",
        "src": "src/assets/photos/kasa.webp",
        "alt": "image du projet Kasa",
        "description": "Refonte d'un site de location de logements en utilisant React pour la partie front-end ainsi que React-router et Sass, mise en oeuvre d'animations CSS." ,
        "github": "https://github.com/VivianeCG/P6_kasa.git"
    },
    {
        "id": "5",
        "title": "Mon vieux grimoire",
        "src": "src/assets/photos/vieux-grimoire.webp",
        "alt": "image du projet Mon vieux Grimoire",
        "description": "Mise en place du backend d'un site qui permet aux membres d'ajouter un livre et de mettre une note visible par le public. Optimisation des images. Implémenter un modèle logique de données, mettre en oeuvre le CRUD et stocker des données de manière sécurisée." ,
        "github": "https://github.com/VivianeCG/P7_Mon_Vieux_Grimoire.git"
    }
]